mistyrain83/cc3200app/user/wifiapp/main.c
        case SL_NETAPP_IP_LEASED_EVENT:
        {
            SET_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_LEASED);

            //
            // Information about the IP-Leased details(like IP-Leased,lease-time,
            // mac etc) will be available in 'SlIpLeasedAsync_t' - Applications
            // can use it if required
            //
            // SlIpLeasedAsync_t *pEventData = NULL;
            // pEventData = &pNetAppEvent->EventData.ipLeased;
            //

        }
        break;

        case SL_NETAPP_IP_RELEASED_EVENT:
        {
            CLR_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_LEASED);

            //
            // Information about the IP-Released details (like IP-address, mac
            // etc) will be available in 'SlIpReleasedAsync_t' - Applications
            // can use it if required
            //
            // SlIpReleasedAsync_t *pEventData = NULL;
            // pEventData = &pNetAppEvent->EventData.ipReleased;
            //
        }
		break;

        default:
        {
            UART_PRINT("[NETAPP EVENT] Unexpected event [0x%x] \n\r",
                       pNetAppEvent->Event);
        }
        break;
    }
}


//*****************************************************************************
//
//! \brief This function handles HTTP server events
//!
//! \param[in]  pServerEvent - Contains the relevant event information
//! \param[in]    pServerResponse - Should be filled by the user with the
//!                                      relevant response information
//!
//! \return None
//!
//****************************************************************************
void SimpleLinkHttpServerCallback(SlHttpServerEvent_t *pSlHttpServerEvent, 
                                SlHttpServerResponse_t *pSlHttpServerResponse)
{
    switch (pSlHttpServerEvent->Event)
    {
        case SL_NETAPP_HTTPGETTOKENVALUE_EVENT:
        {
            unsigned char *ptr;

            ptr = pSlHttpServerResponse->ResponseData.token_value.data;
            pSlHttpServerResponse->ResponseData.token_value.len = 0;
            

           

		if (0== memcmp (pSlHttpServerEvent->EventData.httpTokenName.data, \
                                  "__SL_G_UCI", \
                                  pSlHttpServerEvent->EventData.httpTokenName.len))
              {
                  
                  // Important - Token value len should be < MAX_TOKEN_VALUE_LEN
                  memcpy (pSlHttpServerResponse->ResponseData.token_value.data, \
                          g_cCurrentIP,g_iCurrentIPLen);
                  pSlHttpServerResponse->ResponseData.token_value.len = g_iCurrentIPLen;
                     
              }
		else if (0== memcmp (pSlHttpServerEvent->EventData.httpTokenName.data, \
                                  "__SL_G_UIP", \
                                  pSlHttpServerEvent->EventData.httpTokenName.len))
              {
                  
                  // Important - Token value len should be < MAX_TOKEN_VALUE_LEN
                  //memcpy (pSlHttpServerResponse->ResponseData.token_value.data, \
                  //        g_cServerIP,strlen(g_cServerIP));
                  //pSlHttpServerResponse->ResponseData.token_value.len = strlen(g_cServerIP);
              }
		else if (0== memcmp (pSlHttpServerEvent->EventData.httpTokenName.data, \
                                  "__SL_G_UPT", \
                                  pSlHttpServerEvent->EventData.httpTokenName.len))
              {
                  
                  // Important - Token value len should be < MAX_TOKEN_VALUE_LEN
                  //memcpy (pSlHttpServerResponse->ResponseData.token_value.data, \
                  //        g_cServerPort,strlen(g_cServerPort));
                  //pSlHttpServerResponse->ResponseData.token_value.len = strlen(g_cServerPort);
              }
			  

        }
            break;

        case SL_NETAPP_HTTPPOSTTOKENVALUE_EVENT:
        {
            unsigned char led;
            unsigned char *ptr = pSlHttpServerEvent->EventData.httpPostData.token_name.data;
			
			/* Post request - print post values */
              DBG_PRINT("Post request\n\r");

              if ((0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data, \
                                "__SL_P_USC", \
                pSlHttpServerEvent->EventData.httpPostData.token_name.len)) && \
                (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_value.data, \
                                  "Apply", \
                   pSlHttpServerEvent->EventData.httpPostData.token_value.len)))
              {
                  UART_PRINT("Catch Apply Button\n\r");
				  g_iSaveFlag = SUCCESS;
              }
              
              
              
              
              if (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data, \
                               "__SL_P_UIP", \
                               pSlHttpServerEvent->EventData.httpPostData.token_name.len))
              {
                  memcpy (g_cServerIP,pSlHttpServerEvent->EventData.httpPostData.token_value.data, \
                          pSlHttpServerEvent->EventData.httpPostData.token_value.len);
                  
                  g_cServerIP[pSlHttpServerEvent->EventData.httpPostData.token_value.len] = 0;
                  
				  UART_PRINT("len %d Server IP: %s\n\r", pSlHttpServerEvent->EventData.httpPostData.token_value.len, g_cServerIP);
				  sscanf (g_cServerIP,"%d.%d.%d.%d", &g_iIP[0], &g_iIP[1], &g_iIP[2], &g_iIP[3]);
				  UART_PRINT("ip = %d.%d.%d.%d\n", g_iIP[3],g_iIP[2],g_iIP[1],g_iIP[0]);
				  UART_PRINT("ip = 0x%x\n", htonl(SL_IPV4_VAL(g_iIP[3],g_iIP[2],g_iIP[1],g_iIP[0])));
				  UART_PRINT("ip3 = %s\n",g_cServerIP);
				  g_uiServerIP = htonl(SL_IPV4_VAL(g_iIP[3],g_iIP[2],g_iIP[1],g_iIP[0]));
              }
              
              if (0 == memcmp (pSlHttpServerEvent->EventData.httpPostData.token_name.data, \
                                "__SL_P_UPT", \
                               pSlHttpServerEvent->EventData.httpPostData.token_name.len))
              {
                 memcpy (g_cServerPort,pSlHttpServerEvent->EventData.httpPostData.token_value.data, \
                          pSlHttpServerEvent->EventData.httpPostData.token_value.len);
                  
                  g_cServerPort[pSlHttpServerEvent->EventData.httpPostData.token_value.len] = 0;
                  
				  UART_PRINT("len %d Server Port: %s\n\r", pSlHttpServerEvent->EventData.httpPostData.token_value.len, g_cServerPort);
					UART_PRINT("port1 = %d\n", (atoi(g_cServerPort)));
				  UART_PRINT("port2 = %d\n", htons(atoi(g_cServerPort)));
				  g_usServerPort = atoi(g_cServerPort);
              }
              
              
			
			

            //g_ucLEDStatus = 0;
            if(memcmp(ptr, POST_token, strlen((const char *)POST_token)) == 0)
            {
                ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;
                if(memcmp(ptr, "LED", 3) != 0)
                    break;
                ptr += 3;
                led = *ptr;
                ptr += 2;
                if(led == '1')
                {
                    if(memcmp(ptr, "ON", 2) == 0)
                    {
                        GPIO_IF_LedOn(MCU_RED_LED_GPIO);

