mistyrain83/cc3200app/user/wifiapp/main.c
				  LOOP_FOREVER();
		        }
			}

			g_iSendLoopNum++;
			osi_Sleep(100);
		}
    }	

}

//****************************************************************************
//
//! Process the main async event
//!
//! \param  none
//!
//! \return none
//
//****************************************************************************
void TimerCycleIntHandler(void)
{
	//
    // Clear the timer interrupt.
    //
    Timer_IF_InterruptClear(TIMERA1_BASE);

	// process event
	switch(g_sRedLed.cmd)
	{
		case DO_CMD_OFF:
			GPIO_IF_LedOff(MCU_RED_LED_GPIO);
			g_sRedLed.cmd = DO_CMD_DEFAULT;
			break;
		case DO_CMD_ON:
			GPIO_IF_LedOn(MCU_RED_LED_GPIO);
			g_sRedLed.cmd = DO_CMD_DEFAULT;
			break;
		case DO_CMD_TOGGLE:
			GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
			g_sRedLed.cmd = DO_CMD_DEFAULT;
			break;
		default:
			break;
		
	}
	if(g_sRedLed.flag == TRUE)
	{
		g_sRedLed.loopnum--;
		if(g_sRedLed.loopnum == 0)
		{
			g_sRedLed.flag = FALSE;
			GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
			g_sRedLed.cmd = DO_CMD_DEFAULT;
		}
	}
    
}

//*****************************************************************************
//
//! This function is button (switch) interrupt handler, also process the
//! switch bounce. the delay timer is SWITCH_BOUNCE_TIME
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void SwIntHandler(void)
{
	static long L_prevButtonState = 0x00;    
	static long L_buttonState     = 0x00;

	if(MAP_GPIOIntStatus(BUTTON_PORT, true) & BUTTON_PINS)
	{
		MAP_GPIOIntClear(BUTTON_PORT, BUTTON_PINS);
	}
	
	L_buttonState = GPIOPinRead(BUTTON_PORT, BUTTON_PINS);
	
	if( !(L_prevButtonState & BUTTON_PINS) && (L_buttonState & BUTTON_PINS) )
	{
		g_iSwPressedNum++;
		if(g_iSwPressedNum == 1)
		{
			//
		    // Turn on the timers
		    //
		    Timer_IF_Start(TIMERA0_BASE, TIMER_A,
		                  PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS);
		}
		UART_PRINT("[INFO] BUTTON pressed\n\r");
	}
	
	L_prevButtonState = L_buttonState;
	MAP_UtilsDelay(SWITCH_BOUNCE_TIME);
}

//*****************************************************************************
//
//! This function handles the times of button pressed
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void TimerIntHandler(void)
{
	//
    // Clear the timer interrupt.
    //
    Timer_IF_InterruptClear(TIMERA0_BASE);
	Timer_IF_Stop(TIMERA0_BASE, TIMER_A);
	switch(g_iSwPressedNum)
	{
	case 4:
		UART_PRINT("pressed 4 times\n");
		break;
	case 6:
		UART_PRINT("pressed 6 times\n");
		break;
	default:
		break;
	}
	g_iSwPressedNum = 0;
	UART_PRINT("clear sw\n");
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t     CC3200 %s Application       \n\r", AppName);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
    //
    // Set vector table base
    //
#if defined(ccs)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif  //ccs
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif  //ewarm
    
#endif  //USE_TIRTOS
    
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main()
{
    long   lRetVal = -1;

    //
    // Board Initilization
    //
    BoardInit();
    
    //
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();

	// Init button timer interrupt handler
	//
    // Configuring the timers
    //
    Timer_IF_Init(PRCM_TIMERA0, TIMERA0_BASE, TIMER_CFG_PERIODIC_UP, TIMER_A, 0);
	//
    // Setup the interrupts for the timer timeouts.
    //
    Timer_IF_IntSetup(TIMERA0_BASE, TIMER_A, TimerIntHandler);

	//
    // Init button interrupt handler
    // BUTTON - PIN_58 - GPIO_03
    //
    GPIO_IF_ConfigureNIntEnable(BUTTON_PORT, BUTTON_PINS, GPIO_BOTH_EDGES, SwIntHandler);

	// Init cycle timer interrupt handler
	//
    // Configuring the timers
    //
    Timer_IF_Init(PRCM_TIMERA1, TIMERA1_BASE, TIMER_CFG_PERIODIC, TIMER_A, 0);
	//
    // Setup the interrupts for the timer timeouts.
    //
    Timer_IF_IntSetup(TIMERA1_BASE, TIMER_A, TimerCycleIntHandler);
	//
    // Turn on the timers
    //
	Timer_IF_Start(TIMERA1_BASE, TIMER_A,
                  PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS / 50);

#if defined(P_DIMMER)
	// Init timer pwm
	//
    // TIMERA3 (TIMER A) as GREEN of RGB light. GPIO 11 --> PWM_7
    //
    SetupTimerPWMMode(TIMERA3_BASE, TIMER_B, 
            (TIMER_CFG_SPLIT_PAIR | TIMER_CFG_A_PWM | TIMER_CFG_B_PWM), 1);

    MAP_TimerEnable(TIMERA3_BASE,TIMER_B);
	UpdateDutyCycle(TIMERA3_BASE, TIMER_B, 0);
#endif

    // Initialize Global Variables
    InitializeAppVariables();
    
    //
    // UART Init
    //
    InitTerm();
    
    DisplayBanner(APP_NAME);
    
  

    //
    // LED Init
    //
    GPIO_IF_LedConfigure(LED1);
      
    //Turn Off the LEDs
    GPIO_IF_LedOff(MCU_RED_LED_GPIO);
    
    //
    // Simplelinkspawntask
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    } 

	
	
    
    //
    // Create OOB Task
    //
    lRetVal = osi_TaskCreate(OOBTask, (signed char*)"OOBTask", \
                                OOB_STACK_SIZE, NULL, \
                                OOB_TASK_PRIORITY, NULL );
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }  
    
    //
    // Create OOB Task
    //
    //lRetVal = osi_TaskCreate(LEDTask, (signed char*)"LEDTask", \
    //                            LED_STACK_SIZE, NULL, \
    //                            LED_TASK_PRIORITY, NULL );

	
    //
    // Start OS Scheduler
    //
    osi_start();

    while (1)
    {

    }

}
